{"id": "18ef4309804d8963a4a37b5ead048247cac3dc257919dedb32c3d9a9083679c7", "title": "ch3.pdf", "summary": "**Process Management Summary**\n\nA process is defined as a program in execution, encompassing its code, current activity, and resources. Processes transition through five states: New, Ready, Running, Waiting, and Terminated, with state transitions managed by the operating system. The Process Control Block (PCB) is crucial for maintaining process information, including state, program counter, CPU registers, and memory management data.\n\nProcess scheduling algorithms, such as First-Come, First-Served (FCFS), Shortest Job First (SJF), and Round Robin, determine which process runs based on criteria like CPU utilization and response time. Context switching, the process of saving and loading process states, incurs overhead and affects performance.\n\nInterprocess communication (IPC) mechanisms, including shared memory and message passing, facilitate synchronization and data exchange between processes. IPC can be implemented using pipes for unidirectional communication or POSIX shared memory for bidirectional communication.\n\nIn client-server models, processes interact through sockets and remote procedure calls (RPC). Understanding these concepts is essential for optimizing system performance and resource utilization in multitasking environments.", "cards_json": "{\"cards\": [{\"type\": \"definition\", \"front\": \"What is a process?\", \"back\": \"A process is defined as a program in execution, encompassing the program code, current activity, and associated resources.\", \"source\": \"Slide 1\"}, {\"type\": \"definition\", \"front\": \"What are the five states of a process?\", \"back\": \"New, Ready, Running, Waiting, and Terminated.\", \"source\": \"Slide 8\"}, {\"type\": \"definition\", \"front\": \"What is the role of the Process Control Block (PCB)?\", \"back\": \"The PCB manages process information, including process state, program counter, CPU registers, and memory management data.\", \"source\": \"Slide 1\"}, {\"type\": \"definition\", \"front\": \"What is context switching?\", \"back\": \"Context switching is the process of storing the state of a currently running process and loading the state of the next scheduled process.\", \"source\": \"Slide 6\"}, {\"type\": \"definition\", \"front\": \"What is process scheduling?\", \"back\": \"Process scheduling involves allocating CPU time to various processes to ensure efficient execution and resource utilization.\", \"source\": \"Slide 15\"}, {\"type\": \"definition\", \"front\": \"What are some criteria for scheduling algorithms?\", \"back\": \"CPU utilization, throughput, turnaround time, waiting time, and response time.\", \"source\": \"Slide 1\"}, {\"type\": \"definition\", \"front\": \"What is the difference between a program and a process?\", \"back\": \"A program is a passive entity, while a process is an active entity that executes instructions in memory.\", \"source\": \"Slide 5\"}, {\"type\": \"definition\", \"front\": \"What is interprocess communication (IPC)?\", \"back\": \"IPC mechanisms allow processes to communicate and synchronize their actions, including shared-memory and message-passing systems.\", \"source\": \"Slide 2\"}, {\"type\": \"definition\", \"front\": \"What are the two main types of scheduling queues?\", \"back\": \"The ready queue and wait queues.\", \"source\": \"Slide 13\"}, {\"type\": \"definition\", \"front\": \"What is the stack in a process?\", \"back\": \"The stack holds function parameters, return addresses, and local variables, essential for function execution and memory management.\", \"source\": \"Slide 4\"}, {\"type\": \"definition\", \"front\": \"What is the heap in a process?\", \"back\": \"The heap allows for dynamic memory allocation, enabling flexible memory usage during runtime.\", \"source\": \"Slide 4\"}, {\"type\": \"definition\", \"front\": \"What is the purpose of the `task_struct` in Linux?\", \"back\": \"The `task_struct` structure represents a process and contains essential fields like `pid`, `state`, and memory management information.\", \"source\": \"Slide 12\"}, {\"type\": \"definition\", \"front\": \"What is the difference between shared memory and message passing?\", \"back\": \"Shared memory is faster but requires synchronization, while message passing is safer and easier to manage.\", \"source\": \"Slide 3\"}, {\"type\": \"definition\", \"front\": \"What is the significance of the data section in a process?\", \"back\": \"The data section stores global variables that persist throughout the program's execution.\", \"source\": \"Slide 4\"}, {\"type\": \"definition\", \"front\": \"What happens during a context switch?\", \"back\": \"The state of the currently running process is saved, and the state of the next process is loaded, incurring overhead.\", \"source\": \"Slide 16\"}, {\"type\": \"definition\", \"front\": \"What is the role of the operating system in process management?\", \"back\": \"The operating system manages process states, scheduling, and resource allocation to optimize CPU utilization.\", \"source\": \"Slide 9\"}, {\"type\": \"definition\", \"front\": \"What is the purpose of the ready queue?\", \"back\": \"The ready queue contains processes that are ready to execute and waiting for CPU time.\", \"source\": \"Slide 14\"}, {\"type\": \"definition\", \"front\": \"What is the purpose of the wait queue?\", \"back\": \"The wait queue holds processes that are waiting for some event to occur before they can proceed.\", \"source\": \"Slide 14\"}, {\"type\": \"definition\", \"front\": \"What are some common process scheduling algorithms?\", \"back\": \"First-Come, First-Served (FCFS), Shortest Job Next (SJN), Round Robin (RR), and Priority Scheduling.\", \"source\": \"Slide 15\"}, {\"type\": \"definition\", \"front\": \"What is the impact of context switching on system performance?\", \"back\": \"Frequent context switching can lead to performance degradation due to increased CPU time spent on switching rather than executing processes.\", \"source\": \"Slide 16\"}, {\"type\": \"definition\", \"front\": \"What is the lifecycle of a process?\", \"back\": \"The lifecycle includes creation, execution, waiting, and termination, managed through system calls like fork(), exec(), and exit().\", \"source\": \"Slide 3\"}]}"}